feat: replace mermaid with D2
